app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "first", "last", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "admin" = 't', "password_digest" = '$2a$10$9phCCC6aNFVjNzQ3FJ06IubliFm0ZHE2aS7r4x7yIVDcFPGZF.CG2', "updated_at" = '2013-05-14 14:18:00.040058' WHERE "users"."id" = 2

  def account
    @user = User.find_by_email(session[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'karan@see.com' LIMIT 1